visitor-app-backend/app/controllers/api/v1/places_controller.rb

    def create
        place = Place.new(place_params)
        if place.save
---
INSERT INTO "places" ("city", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["city", "Oakland Gardens"], ["country", "USA"], ["created_at", "2020-02-06 00:08:36.602177"], ["updated_at", "2020-02-06 00:08:36.602177"]]

    def index
        places = Place.all
---
SELECT "places".* FROM "places"

    def show
        place = Place.find_by_id(params[:id])
---
SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]