visitor-app-backend/app/controllers/api/v1/visits_controller.rb

    def index
        if params[:place_id]
            visits = Place.find_by_id(params[:place_id]).visits
        else
            visits = Visit.all
---
SELECT "visits".* FROM "visits" WHERE "visits"."place_id" = ?  [["place_id", 1]]
SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "visits".* FROM "visits"

    def create
        visit = Visit.new(visit_params)
        if visit.save
---
INSERT INTO "visits" ("venue", "comment", "visitor", "place_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["venue", "Resturant"], ["comment", "Hello"], ["visitor", "Nia"], ["place_id", 14], ["created_at", "2020-02-03 23:17:31.735081"], ["updated_at", "2020-02-03 23:17:31.735081"]]